duxinglang-1/nRF9160_test/AURI_TEST/src/screen/screen.c
/****************************************Copyright (c)************************************************
** File name:			    screen.c
** Last modified Date:          
** Last Version:		   
** Descriptions:		   	使用的ncs版本-1.2		
** Created by:				谢彪
** Created date:			2020-12-16
** Version:			    	1.0
** Descriptions:			屏幕UI管理C文件
******************************************************************************************************/
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <zephyr.h>
#include "settings.h"
#include "lcd.h"
#include "font.h"
#include "img.h"
#include "key.h"
#include "datetime.h"
#include "max20353.h"
#ifdef CONFIG_PPG_SUPPORT
#include "max32674.h"
#endif
#ifdef CONFIG_IMU_SUPPORT
#include "lsm6dso.h"
#include "fall.h"
#endif
#include "external_flash.h"
#include "screen.h"
#include "ucs2.h"
#include "nb.h"
#include "sos.h"
#include "alarm.h"
#include "gps.h"
#include "uart_ble.h"
#ifdef CONFIG_TOUCH_SUPPORT
#include "CST816.h"
#endif
#ifdef CONFIG_FOTA_DOWNLOAD
#include "fota_mqtt.h"
#endif/*CONFIG_FOTA_DOWNLOAD*/
#ifdef CONFIG_WIFI
#include "esp8266.h"
#endif
#ifdef CONFIG_SYNC_SUPPORT
#include "sync.h"
#endif
#include "logger.h"

static u8_t scr_index=0;

static void NotifyTimerOutCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(notify_timer, NotifyTimerOutCallBack, NULL);
static void MainMenuTimerOutCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(mainmenu_timer, MainMenuTimerOutCallBack, NULL);

SCREEN_ID_ENUM screen_id = SCREEN_ID_BOOTUP;
SCREEN_ID_ENUM history_screen_id = SCREEN_ID_BOOTUP;
screen_msg scr_msg[SCREEN_ID_MAX] = {0};
notify_infor notify_msg = {0};

extern bool key_pwroff_flag;
extern u8_t g_rsrp;
extern bool wifi_update_flag;

static void EnterHRScreen(void);

static char *logo_img[] = 
{
	logo_1,
	logo_2,
	logo_3,
	logo_4,
	logo_5
};

void ShowBootUpLogo(void)
{
	u8_t i,count=0;
	u16_t x,y,w,h;

#if 0	//xb add 2021-12-23 不用动画显示 def CONFIG_ANIMATION_SUPPORT
	AnimaShow(PWRON_LOGO_X, PWRON_LOGO_Y, logo_img, ARRAY_SIZE(logo_img), 200, false, EnterIdleScreen);
#else
	LCD_ShowImg(PWRON_LOGO_X, PWRON_LOGO_Y, logo_5);
	k_sleep(K_MSEC(1000));
	EnterIdleScreen();
#endif
}

void ExitNotifyScreen(void)
{
#if 0
	if(screen_id == SCREEN_ID_NOTIFY)
	{
		k_timer_stop(&notify_timer);
		GoBackHistoryScreen();
	}
#else
	sos_state = SOS_STATUS_IDLE;
	k_timer_stop(&notify_timer);
	EnterIdleScreen();
#endif
}

void NotifyTimerOutCallBack(struct k_timer *timer_id)
{
	ExitNotifyScreen();
}

extern bool ppg_start_flag;
extern bool gps_test_start_flag;
void MainMenuTimerOutCallBack(struct k_timer *timer_id)
{
	if(screen_id == SCREEN_ID_HR)
	{
	#ifdef CONFIG_PPG_SUPPORT
		MenuStartPPG();
	#endif
	}
	else if(screen_id == SCREEN_ID_GPS_TEST)
	{
		MenuStartGPS();
	}
	else if(screen_id == SCREEN_ID_NB_TEST)
	{
		MenuStartNB();
	}
	else if(screen_id == SCREEN_ID_BLE_TEST)
	{
		
	}
#ifdef CONFIG_WIFI	
	else if(screen_id == SCREEN_ID_WIFI_TEST)
	{
		MenuStartWifi();
	}
#endif	
#ifdef CONFIG_FOTA_DOWNLOAD	
	else if(screen_id == SCREEN_ID_FOTA)
	{
		MenuStartFOTA();
	}
#endif
#ifdef CONFIG_SYNC_SUPPORT
	else if(screen_id == SCREEN_ID_SYNC)
	{
		MenuStartSync();
	}
#endif
}

void EnterNotifyScreen(void)
{
	if(screen_id == SCREEN_ID_NOTIFY)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_NOTIFY;	
	scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_NOTIFY].status = SCREEN_STATUS_CREATING;	
}

void DisplayPopUp(u8_t *message)
{
	u32_t len;
	
	notify_msg.type = NOTIFY_TYPE_POPUP;
	notify_msg.align = NOTIFY_ALIGN_CENTER;
	
	len = strlen(message);
	if(len > NOTIFY_TEXT_MAX_LEN)
		len = NOTIFY_TEXT_MAX_LEN;
	memset(notify_msg.text, 0x00, sizeof(notify_msg.text));
	memcpy(notify_msg.text, message, len);

	if(notify_msg.type == NOTIFY_TYPE_POPUP)
	{
		k_timer_start(&notify_timer, K_SECONDS(NOTIFY_TIMER_INTERVAL), NULL);
	}
	
	EnterNotifyScreen();
}

void IdleShowSystemDate(void)
{
	unsigned char *img_num[10] = {IMG_DATE_NUM_0,IMG_DATE_NUM_1,IMG_DATE_NUM_2,IMG_DATE_NUM_3,IMG_DATE_NUM_4,
							  		IMG_DATE_NUM_5,IMG_DATE_NUM_6,IMG_DATE_NUM_7,IMG_DATE_NUM_8,IMG_DATE_NUM_9};
	unsigned char *img_month[12] = {IMG_MON_JAN,IMG_MON_FEB,IMG_MON_MAR,IMG_MON_APR,IMG_MON_MAY,IMG_MON_JUN,
							  		IMG_MON_JUL,IMG_MON_AUG,IMG_MON_SEP,IMG_MON_OCT,IMG_MON_NOV,IMG_MON_DEC};

	switch(global_settings.language)
	{
	case LANGUAGE_EN:
	case LANGUAGE_JPN:
		LCD_ShowImg(IDLE_DATA_NUM_1_X, IDLE_DATA_NUM_1_Y, img_num[date_time.day/10]);
		LCD_ShowImg(IDLE_DATA_NUM_2_X, IDLE_DATA_NUM_2_Y, img_num[date_time.day%10]);
		LCD_ShowImg(IDLE_MONTH_X, IDLE_MONTH_Y, img_month[date_time.month-1]);
		break;

	case LANGUAGE_CHN:
		LCD_ShowImg(IDLE_DATA_NUM_1_X, IDLE_DATA_NUM_1_Y, img_num[date_time.month/10]);
		LCD_ShowImg(IDLE_DATA_NUM_2_X, IDLE_DATA_NUM_2_Y, img_num[date_time.month%10]);
		LCD_ShowImg(IDLE_DATE_LINK_X, IDLE_DATE_LINK_Y, IMG_DATE_LINK);
		LCD_ShowImg(IDLE_DATA_NUM_3_X, IDLE_DATA_NUM_3_Y, img_num[date_time.day/10]);
		LCD_ShowImg(IDLE_DATA_NUM_4_X, IDLE_DATA_NUM_4_Y, img_num[date_time.day%10]);
		break;
	}
}

void IdleShowBleStatus(bool flag)
{
	if(flag)
	{
		LCD_ShowImg(IDLE_BLE_X, IDLE_BLE_Y, IMG_BLE_LINK);
	}
	else
	{
		LCD_ShowImg(IDLE_BLE_X, IDLE_BLE_Y, IMG_BLE_UNLINK);
	}
}

void IdleShowTime12Format(bool flag)
{
	unsigned char *img_cn[2] = {IMG_AM_CN, IMG_PM_CN};
	unsigned char *img_en[2] = {IMG_AM_EN, IMG_PM_EN};

	if(flag)
	{
		switch(global_settings.language)
		{
		case LANGUAGE_EN:
		case LANGUAGE_JPN:
			LCD_ShowImg(IDLE_AM_PM_X, IDLE_AM_PM_Y, img_en[date_time.hour/12]);
			break;

		case LANGUAGE_CHN:
			LCD_ShowImg(IDLE_AM_PM_X, IDLE_AM_PM_Y, img_cn[date_time.hour/12]);
			break;
		}
	}
	else
	{
		LCD_Fill(IDLE_AM_PM_X, IDLE_AM_PM_Y, IDLE_AM_PM_W, IDLE_AM_PM_H, BLACK);
	}
}

void IdleShowSystemTime(void)
{
	static bool colon_flag = true;
	u8_t hour;
	unsigned char *img[10] = {IMG_TIME_NUM_0,IMG_TIME_NUM_1,IMG_TIME_NUM_2,IMG_TIME_NUM_3,IMG_TIME_NUM_4,
							  IMG_TIME_NUM_5,IMG_TIME_NUM_6,IMG_TIME_NUM_7,IMG_TIME_NUM_8,IMG_TIME_NUM_9};
	unsigned char *img_colon[2] = {IMG_TIME_SPE_NO,IMG_TIME_SPE};

